BUMP2D/bump2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application		rhoEnergyFoam;

startFrom		startTime;

startTime      		0;

stopAt         		endTime;

endTime         	40;

deltaT          	0.00002;

writeControl    	adjustableRunTime;

writeInterval   	0.1;

purgeWrite      	0;

writeFormat     	ascii;

writePrecision  	6;

writeCompression 	off;

timeFormat      	general;

timePrecision   	6;

runTimeModifiable 	true;

maxCo           	0.7;

maxDeltaT       	1.;

pressArtDiff    	false; //activate artificial diffusion on pressure
convArtDiff     	false; //activate artificial diffusion on pressure

ducLevelPress       	0.00;
ducLevelConv        	0.05;
epsilon             	0.014;
minfty              	0.765; //Reference Mach^2 number needed by AUSM flux
ku                  	0.75;
kp                  	0.25;
sigma               	1.;

functions
{
/*
    pressure
    {
        type            pressure;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        result          Cp;
        mode            staticCoeff;
        rho             rhoInf;
        rhoInf          1;
        U               UInf;
        UInf            (69.44 0 0);
        pInf            0;
    }

    forceCoeffs
    {
        type            forceCoeffs;
        libs            (forces);
        writeControl    writeTime;
        rho             rhoInf;
        rhoInf          1;
        liftDir         (0 1 0);
        dragDir         (1 0 0);
        CofR            (0.75 0 0); // bump midpoint
        pitchAxis       (0 0 1);
        magUInf         69.44;
        lRef            0.9; // length of bump
        Aref            0.1; // mesh span = 2, bump height = 0.05; 2*0.05=0.1
        patches         (bump);
    }

    wallShearStress
    {
        type            wallShearStress;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        patches         (bump);
    }

    yPlus
    {
        type            yPlus;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        patches         (bump);
    }

    cellCentres
    {
        type            writeCellCentres;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
    }

    residuals
    {
        type            solverInfo;
        libs            (utilityFunctionObjects);
        fields          (".*");
    }
*/
    writeduc
    {
    type                 writeObjects;
    libs                 ("libutilityFunctionObjects.so");
    objects              ("ducSensor");
    writeControl         outputTime;
    writeInterval        1;
    }



}

// ************************************************************************* //
