BUMP2D/bump2D/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme	        Kurganov;

ddtSchemes
{
    default             Euler;
}

gradSchemes
{
    default             Gauss linear;
}

divSchemes
{
    default             Gauss linear;
    div(tauMC)          Gauss linear;
/*
    div(phi,U)       bounded Gauss linearUpwind grad(U);
    div(phi,epsilon) bounded Gauss upwind;
    div(phi,omega)   bounded Gauss upwind;
    div(phi,k)       bounded Gauss upwind;
    div(phi,nuTilda) bounded Gauss upwind;
    div(phi,phit)    bounded Gauss upwind;
    div(phi,f)       bounded Gauss upwind;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
*/
}

laplacianSchemes
{
    default             Gauss linear corrected;
}

interpolationSchemes
{
    default             midPoint;
    reconstruct(p)      Minmod;
    reconstruct(M)      Minmod;
    reconstruct(T)      Minmod;
    reconstruct(rho)    Minmod;
    reconstruct(U)      Minmod;
    reconstruct(rhoU)   midPoint;
}

snGradSchemes
{
    default             corrected; //limited 1;
}

wallDist
{
    method              meshWave;

    correctWalls	true;
}


// ************************************************************************* //
